{
    "projects": [{
        "name": "Personal Finance Startup",
        "images": ["astra/astra1-thumb.png"],
        "description": "Mobile web application for a pre-beta personal finance startup using machine learning. As part of a team, built front-end features using a React/Redux-based stack and spearheaded efforts tracking and fixing bugs using Sentry.",
        "tools": "React.js, Redux, Reselect, Redux Thunk, Material UI, Styled Components, Jest, Webpack, Python, Flask, Google App Engine"
    }, {
        "name": "Freelance Site",
        "images": ["ub/ub1.png"],
        "description": "Responsive web site and application for freelance developers and projects. As part of a team, I was responsible for building responsive React components and maintaining the project style guide. I was the go-to on the project for solving responsive layout issues.",
        "tools": "HTML, Sass/CSS, React.js, Redux, Jest, Webpack"
    }, {
        "name": "Tech Flash Sale Sites",
        "images": ["firestarter/fs1.png"],
        "description": "Built a Shopify template for a tech client to launch branded flash sale sites. Interactive components built using React.js.",
        "tools": "HTML, Shopify/Liquid templates, Sass/CSS, React.js, gulp+Webpack"
    }, {
        "name": "Shoap Technical Services",
        "images": ["shoap/shoap1-thumb.png"],
        "description": "Responsive retrofit for an existing WordPress website for a consulting firm. Updated existing design to work responsively across all devices, from phones to desktop.",
        "tools": "HTML, CSS, JavaScript, jQuery, WordPress"
    }, {
        "name": "Cancer Research Fund",
        "images": ["cancer/cancer3.png"],
        "description": "Built responsive front-end for cancer research fund website to be integrated into Rails backend.",
        "tools": "HTML, Sass/CSS, JavaScript, gulp"
    }, {
        "name": "Non-Profit Site",
        "images": ["ec/ec2.png"],
        "description": "Numerous bug fixes and additional features for non-profit website. Site is built on Squarespace using a custom JavaScript front-end featuring cutting edge ESNext.",
        "tools": "HTML, Sass/CSS, JavaScript, Webpack, Squarespace"
    }, {
        "name": "Aerospace Startup",
        "images": ["aero/aero1.gif"],
        "description": "Update for aerospace startup website. Built custom HTML-canvas based parallax library for improved site performance. Converted website to Jekyll for easier updates. Add integration with HelloSign API to allow NDA signing on company website.",
        "tools": "HTML, Sass/CSS, Jekyll, gulp, PHP, HelloSign API"
    }, {
        "name": "Stadium Map",
        "images": ["stadium-map-med.jpg"],
        "description": "Responsive, single page Google Maps application. Shows all the current stadiums for the MLB, NFL, NBA, NHL, and MLS. With search functions, and integrates data and photos from Foursquare and the New York Times via AJAX. For Udacity Front-End Web Developer nanodegree.",
        "tools": "HTML, Sass/CSS, Knockout.js, jQuery, gulp, Google Maps API, Foursquare API",
        "projecturl": {
            "name": "American Stadiums Map",
            "url": "http://6stringbeliever.github.io/neighborhood-map/"
        },
        "sourceurl": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/neighborhood-map"
        }
    }, {
        "name": "Evntr",
        "images": ["evntr-med.jpg"],
        "description": "Responsive event application prototype. Home page displays events you've created and includes forms for signing up, logging in, and creating events. Built a client-side validation library that uses the new HTLM5 web form validation API. Allows you to search for location suggestions from Foursquare either by address/ZIP or nearby, using the geolocation API. Built a very basic simulated backend using local storage. For Udacity Senior Web Developer nanodegree.",
        "tools": "HTML, Sass/CSS, JavaScript, Mustache.js, Foursquare API, local storage API, geolocation API, web form validation API",
        "projecturl": {
            "name": "Evntr",
            "url": "http://6stringbeliever.github.io/evntr-mobile/"
        },
        "sourceurl": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/evntr-mobile"
        }
    }, {
        "name": "RFP Responder",
        "images": ["rfp-med.jpg"],
        "description": "An application for managing boilerplate used for creating proposals in response to RFPs. Developed the entire front-end and back-end. Also, created initial wireframes and performed extensive usability testing. For web development course in MS HCI program.",
        "tools": "HTML, CSS, JavaScript, jQuery, PHP, MySQL",
        "projecturl": {
            "name": "RFP Responder",
            "url": "http://rfp.superawesomegood.com"
        },
        "sourceurl": {
            "name": "bitbucket",
            "url": "https://bitbucket.org/6stringbeliever/rfp-responder"
        }
    }],
    "littleprojects": [{
        "name": "Canvas Game",
        "description": "HTML5 canvas game. Collect gems and avoid getting hit by bugs. An exercise in object-oriented JavaScript for the Udacity Front-End Web Developer nanodegree.",
        "url": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/frontend-nanodegree-arcade-game"
        }
    }, {
        "name": "Web Performance Optimization",
        "description": "Optimized sample portfolio site HTML, CSS, and JavaScript to achieve > 90 PageSpeed Insights scores on both desktop and mobile and achieve 60fps animation. For Udacity Front-End Web Developer nanodegree.",
        "url": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/frontend-nanodegree-mobile-portfolio"
        }
    }, {
        "name": "JavaScript Testing with Jasmine",
        "description": "Create tests for a basic feed reader application using the Jasmine testing framework. For Udacity Front-End Web Developer nanodegree.",
        "url": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/frontend-nanodegree-feedreader"
        }
    }, {
        "name": "PDF Comp Coding",
        "description": "Coded responsive HTML and CSS with Bootstrap to achieve a > 99% visual match with a PDF comp. For Udacity Front-End Web Developer nanodegree.",
        "url": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/uda-nano-p1"
        }
    }, {
        "name": "JavaScript Coding Challenge",
        "description": "Complete a series of FizzBuzz-type JavaScript challenges. For Udacity Front-End Web Developer nanodegree.",
        "url": {
            "name": "github",
            "url": "https://github.com/6stringbeliever/uda-nano-p2"
        }
    }]
}
